examples/00-test-case/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
#------------------------------------------------------------------------------

blockMesh
icoThermFoam
